# Домашнее задание по Теме 5 «Библиотека Pandas»

In [1]:
import pandas as pd

## Задание 1

Определите, какому фильму было выставлено больше всего оценок 5.0.

In [2]:
df_1 = pd.read_csv(r"C:\Users\slava\Downloads\10._Основы_pandas\Файлы к заданию №1\movies.csv")
df_2 = pd.read_csv(r"C:\Users\slava\Downloads\10._Основы_pandas\Файлы к заданию №1\ratings.csv")

In [3]:
df_1.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [4]:
df_2.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [5]:
df_2[df_2['rating'] == 5.0]['movieId'].value_counts()

318       153
296       123
356       116
2571      109
260       104
         ...
668         1
581         1
496         1
347         1
156371      1
Name: movieId, Length: 2954, dtype: int64

In [6]:
df_1[df_1['movieId'] == 318]['title']

277    Shawshank Redemption, The (1994)
Name: title, dtype: object

## Задание 2

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 год. Не учитывайте в расчётах отрицательные значения quantity.

In [7]:
power = pd.read_csv(r"C:\Users\slava\Downloads\10._Основы_pandas\Файлы к заданию №2\power.csv")

In [8]:
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [9]:
power_1 = power[power['quantity']>0]
power_1 = power_1.query('2005 <= year <= 2010')

In [10]:
baltic_countries = ['Latvia', 'Lithuania', 'Estonia']
categories = [4, 12, 21]

power_1 = power_1.query('country in @baltic_countries and category in @categories')
power_1

          country  year  quantity  category
10617     Estonia  2008       1.0         4
10620     Estonia  2005       1.0         4
11156   Lithuania  2008       1.0         4
11158   Lithuania  2006       1.0         4
11159   Lithuania  2005       1.0         4
...           ...   ...       ...       ...
253982  Lithuania  2009      98.0        21
253983  Lithuania  2008      54.0        21
253984  Lithuania  2007      47.0        21
253985  Lithuania  2006      31.0        21
253986  Lithuania  2005       1.0        21

[347 rows x 4 columns]

In [11]:
print('Суммарное потребление стран Прибалтики категорий 4, 12 и 21 за период с 2005 по 2010 год  =', \
      power_1['quantity'].sum())

Суммарное потребление стран Прибалтики категорий 4, 12 и 21 за период с 2005 по 2010 год  = 240580.0